error-codes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Error Codes</title>
<!-- 2014-05-01 Do 23:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maik Schünemann" />
</head>
<body>
<div id="content">
<h1 class="title">Error Codes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Setting up</a></li>
<li><a href="#sec-3">3. Getting the edits between the texts</a>
<ul>
<li><a href="#sec-3-1">3.1. Calculating the edit distance</a></li>
<li><a href="#sec-3-2">3.2. Backtracking the edits from the levenshtein matrix</a></li>
<li><a href="#sec-3-3">3.3. Calculating the edits</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Getting the error codes from the edit distance</a>
<ul>
<li><a href="#sec-4-1">4.1. Extracting basic error-codes</a></li>
<li><a href="#sec-4-2">4.2. Extracting many-to-one and one-to-many errors</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Recognizing these errors</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Setting up the extraction list</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Testing the error-codes</a></li>
<li><a href="#sec-6">6. Helpers for deployment to ocr-visualizer</a></li>
<li><a href="#sec-7">7. Todos</a>
<ul>
<li><a href="#sec-7-1">7.1. <span class="todo TODO">TODO</span> determine right error codes for many-to-one errors</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr  />
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This program solves the problem of extracting semantic ocr-failures
between a two texts, one that is the ground-truth and the other is
the performed result from the ocr.
</p>

<p>
The ocr-failure codes are given by the following matrix:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">&#xa0;</td>
<td class="right">1</td>
<td class="right">2</td>
<td class="right">3</td>
<td class="right">4</td>
<td class="right">5</td>
<td class="right">6</td>
<td class="right">7</td>
<td class="right">8</td>
<td class="right">9</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">7</td>
<td class="right">2</td>
<td class="right">5</td>
<td class="right">6</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">7</td>
<td class="right">2</td>
<td class="right">5</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">7</td>
<td class="right">2</td>
<td class="right">5</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">7</td>
<td class="right">2</td>
<td class="right">5</td>
<td class="right">6</td>
</tr>

<tr>
<td class="right">5</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">7</td>
<td class="right">2</td>
<td class="right">5</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="right">7</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="right">8</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="right">9</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The codes are the following:
</p>
<ul class="org-ul">
<li>1 letter   
</li>
<li>2 Punctuation 
</li>
<li>3 digit 
</li>
<li>4 special character 
</li>
<li>5 whitespace 
</li>
<li>6 part of character 
</li>
<li>7 multiple characters 
</li>
<li>8 missing character 
</li>
<li>9 Case error 
</li>
</ul>

<p>
The values in the matrix are the weights for the particular
ocr-error. The values shown here are examples, they can be changed
for particular situations.
</p>

<p>
The idea is to separate the semantic informations of the ocr-errors
from just the sum of error points that determines the quality of the
ocr.
</p>


<p>
The task of the program is to extract the correct error-codes and
their locations from theground-truth and ocr-results texts.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Setting up</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #b0c4de;">ns</span> error-codes.core
  (<span style="color: #7fffd4;">:require</span> [clojure.java.io <span style="color: #7fffd4;">:refer</span> [file]])
  (<span style="color: #7fffd4;">:use</span> [clojure.core.matrix]))

(set! *warn-on-reflection* true)
</pre>
</div>

<pre class="example">
true
</pre>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #b0c4de;">ns</span> error-codes.test-core
  (<span style="color: #7fffd4;">:require</span> [clojure.test <span style="color: #7fffd4;">:refer</span> <span style="color: #7fffd4;">:all</span>]
            [error-codes.core <span style="color: #7fffd4;">:refer</span> <span style="color: #7fffd4;">:all</span>]
            [clojure.core.matrix <span style="color: #7fffd4;">:refer</span> <span style="color: #7fffd4;">:all</span>]))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Getting the edits between the texts</h2>
