error-codes.org
** Calculating the edit distance
   Before we can see what errors were performed by the ocr we need a
   correspondence between the characters in the ground truths text and
   the characters in the ocr-results text.
   If the ocr would miss a character all further characters would also
   be misaligned. 
   Therefore we need informations about the /changes/ between
   ground-truths and ocr-results when they are maximally aligned.
   
   To get this, we can use the [[http://en.wikipedia.org/wiki/Levenshtein_distance][levenshtein distance]], which is defined
   as the minimum number of single-character edits (i.e. insertions,
   deletions or substitutions) required to change one word into the
   other.
   
   The levenshtein distance is computed by the standard dynamic
   programming algorithm:
   #+begin_src clojure :tangle src/error_codes/core.clj :ns error-codes.core
     (defn lev [str1 str2]
       (let [mat (new-matrix :ndarray (inc (count str1)) (inc (count str2)))]
          (mset! mat 0 0 0)
          (dotimes [i (count str1)]
            (mset! mat (inc i) 0 (inc i)))
          (dotimes [j (count str2)]
            (mset! mat 0 (inc j) (inc j)))
          (dotimes [dj (count str2)]
            (dotimes [di (count str1)]
              (let [j (inc dj) i (inc di)]
               	(mset! mat i j
                       (cond
                       	(= (.charAt ^String str1 di) (.charAt ^String str2 dj))
                       	(mget mat di dj)
                       	:else
                       	(min (inc (mget mat di j)) (inc (mget mat i dj))
                             (inc (mget mat di dj))))))))
          mat))


   #+end_src 

   #+RESULTS:
   : #'error-codes.core/lev

   This fills a 2-dimensional array which are filled with the
   levenshtein distances for substrings of the texts.The full 
   levenshtein-distance is in the field [(count gt) (count or)] of the
   created matrix.

   #+begin_src clojure :tangle test/error_codes/test_core.clj :ns error-codes.test-core    
     (defn lev-distance [a b]
       	(let [m (lev a b)]
          (mget m (count a) (count b))))
      
      (deftest test-lev
       	(is (= 1 (lev-distance "" "a")))
       	(is (= 1 (lev-distance "a" "")))
       	(is (= 3 (lev-distance "kitten" "sitting"))))
     
     (test-lev)
   #+end_src 
   #+RESULTS:
   : nil


** Backtracking the edits from the levenshtein matrix
   We are not interested in the edit distance, but in the *edits* that
   were performed to calculate it! 
   One possibility would be to store not the current distance in the
   cells of the matrix but the edits so far in addition to the
   distance. However, this approach has proven too slow (manipulating
   maps instead of doubles while creating the levenshtein matrix).
   It is however possible, to /trace/ back the patch on wich the full
   levenshtein distance was created from the created matrix. This is 
   described [[http://de.wikipedia.org/wiki/Levenshtein-Distanz][here]].
   The order of branches in the backtrace function is important!
   moving the check for substitutions to the front favours the way
   with substitutions about other ways with insertions and deletions
   which have the same error count

   The edits between the files are represented as a map with the keys 
   :insertions, :deletions, and :substitutions which have a sequence
   of pairs [a b] as values where a and b specify the position where
   the edit was performed in the ground-truth and the orc-results
   texts

   #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
     (defn backtrace [d i j acc]
       (cond
        (and (> i 0) (= (inc (mget d (dec i) j)) (mget d i j)))
        (recur d (dec i) j (assoc acc :deletions (cons [(dec i) j] (:deletions acc))))
        (and (> j 0) (= (inc (mget d i (dec j))) (mget d i j)))
        (recur d i (dec j) (assoc acc :insertions (cons [i (dec j)] (:insertions acc))))
        (and (> i 0) (> j 0) (= (inc (mget d (dec i) (dec j))) (mget d i j)))
        (recur d (dec i) (dec j) (assoc acc :substitutions (cons [(dec i) (dec j)] (:substitutions acc))))
        (and (> i 0) (> j 0) (= (mget d (dec i) (dec j)) (mget d i j)))
        (recur d (dec i) (dec j) acc)
        :else acc))
   #+end_src 

   #+RESULTS:
   : #'error-codes.core/backtrace
   
