error-codes.html
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Calculating the edit distance</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Before we can see what errors were performed by the ocr we need a
correspondence between the characters in the ground truths text and
the characters in the ocr-results text.
If the ocr would miss a character all further characters would also
be misaligned. 
Therefore we need informations about the <i>changes</i> between
ground-truths and ocr-results when they are maximally aligned.
</p>

<p>
To get this, we can use the <a href="http://en.wikipedia.org/wiki/Levenshtein_distance">levenshtein distance</a>, which is defined
as the minimum number of single-character edits (i.e. insertions,
deletions or substitutions) required to change one word into the
other.
</p>

<p>
The levenshtein distance is computed by the standard dynamic
programming algorithm:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">lev</span> [str1 str2]
  (<span style="color: #b0c4de;">let</span> [mat (new-matrix <span style="color: #7fffd4;">:ndarray</span> (<span style="color: #eedd82;">inc</span> (<span style="color: #eedd82;">count</span> str1)) (<span style="color: #eedd82;">inc</span> (<span style="color: #eedd82;">count</span> str2)))]
     (mset! mat 0 0 0)
     (<span style="color: #b0c4de;">dotimes</span> [i (<span style="color: #eedd82;">count</span> str1)]
       (mset! mat (<span style="color: #eedd82;">inc</span> i) 0 (<span style="color: #eedd82;">inc</span> i)))
     (<span style="color: #b0c4de;">dotimes</span> [j (<span style="color: #eedd82;">count</span> str2)]
       (mset! mat 0 (<span style="color: #eedd82;">inc</span> j) (<span style="color: #eedd82;">inc</span> j)))
     (<span style="color: #b0c4de;">dotimes</span> [dj (<span style="color: #eedd82;">count</span> str2)]
       (<span style="color: #b0c4de;">dotimes</span> [di (<span style="color: #eedd82;">count</span> str1)]
         (<span style="color: #b0c4de;">let</span> [j (<span style="color: #eedd82;">inc</span> dj) i (<span style="color: #eedd82;">inc</span> di)]
           (mset! mat i j
                  (<span style="color: #b0c4de;">cond</span>
                   (<span style="color: #eedd82;">=</span> (<span style="color: #b0c4de;">.charAt</span> <span style="color: #b0c4de;">^String</span> str1 di) (<span style="color: #b0c4de;">.charAt</span> <span style="color: #b0c4de;">^String</span> str2 dj))
                   (mget mat di dj)
                   <span style="color: #7fffd4;">:else</span>
                   (<span style="color: #eedd82;">min</span> (<span style="color: #eedd82;">inc</span> (mget mat di j)) (<span style="color: #eedd82;">inc</span> (mget mat i dj))
                        (<span style="color: #eedd82;">inc</span> (mget mat di dj))))))))
     mat))
</pre>
</div>

<p>
This fills a 2-dimensional array which are filled with the
levenshtein distances for substrings of the texts.The full 
levenshtein-distance is in the field [(count gt) (count or)] of the
created matrix.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">lev-distance</span> [a b]
   (<span style="color: #b0c4de;">let</span> [m (lev a b)]
     (mget m (<span style="color: #eedd82;">count</span> a) (<span style="color: #eedd82;">count</span> b))))

 (<span style="color: #00ffff;">deftest</span> <span style="color: #87cefa;">test-lev</span>
   (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> 1 (lev-distance <span style="color: #ffa07a;">""</span> <span style="color: #ffa07a;">"a"</span>)))
   (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> 1 (lev-distance <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">""</span>)))
   (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> 3 (lev-distance <span style="color: #ffa07a;">"kitten"</span> <span style="color: #ffa07a;">"sitting"</span>))))

(test-lev)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Backtracking the edits from the levenshtein matrix</h3>
<div class="outline-text-3" id="text-3-2">
<p>
We are not interested in the edit distance, but in the <b>edits</b> that
were performed to calculate it! 
One possibility would be to store not the current distance in the
cells of the matrix but the edits so far in addition to the
distance. However, this approach has proven too slow (manipulating
maps instead of doubles while creating the levenshtein matrix).
It is however possible, to <i>trace</i> back the patch on wich the full
levenshtein distance was created from the created matrix. This is 
described <a href="http://de.wikipedia.org/wiki/Levenshtein-Distanz">here</a>.
The order of branches in the backtrace function is important!
moving the check for substitutions to the front favours the way
with substitutions about other ways with insertions and deletions
which have the same error count
</p>

<p>
The edits between the files are represented as a map with the keys 
</p>
<p>
:insertions, :deletions, and :substitutions which have a sequence
of pairs [a b] as values where a and b specify the position where
the edit was performed in the ground-truth and the orc-results
texts
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">backtrace</span> [d i j acc]
  (<span style="color: #b0c4de;">cond</span>
   (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">&gt;</span> i 0) (<span style="color: #eedd82;">=</span> (<span style="color: #eedd82;">inc</span> (mget d (<span style="color: #eedd82;">dec</span> i) j)) (mget d i j)))
   (<span style="color: #b0c4de;">recur</span> d (<span style="color: #eedd82;">dec</span> i) j (<span style="color: #eedd82;">assoc</span> acc <span style="color: #7fffd4;">:deletions</span> (<span style="color: #eedd82;">cons</span> [(<span style="color: #eedd82;">dec</span> i) j] (<span style="color: #7fffd4;">:deletions</span> acc))))
   (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">&gt;</span> j 0) (<span style="color: #eedd82;">=</span> (<span style="color: #eedd82;">inc</span> (mget d i (<span style="color: #eedd82;">dec</span> j))) (mget d i j)))
   (<span style="color: #b0c4de;">recur</span> d i (<span style="color: #eedd82;">dec</span> j) (<span style="color: #eedd82;">assoc</span> acc <span style="color: #7fffd4;">:insertions</span> (<span style="color: #eedd82;">cons</span> [i (<span style="color: #eedd82;">dec</span> j)] (<span style="color: #7fffd4;">:insertions</span> acc))))
   (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">&gt;</span> i 0) (<span style="color: #eedd82;">&gt;</span> j 0) (<span style="color: #eedd82;">=</span> (<span style="color: #eedd82;">inc</span> (mget d (<span style="color: #eedd82;">dec</span> i) (<span style="color: #eedd82;">dec</span> j))) (mget d i j)))
   (<span style="color: #b0c4de;">recur</span> d (<span style="color: #eedd82;">dec</span> i) (<span style="color: #eedd82;">dec</span> j) (<span style="color: #eedd82;">assoc</span> acc <span style="color: #7fffd4;">:substitutions</span> (<span style="color: #eedd82;">cons</span> [(<span style="color: #eedd82;">dec</span> i) (<span style="color: #eedd82;">dec</span> j)] (<span style="color: #7fffd4;">:substitutions</span> acc))))
   (<span style="color: #b0c4de;">and</span> (<span style="color: #eedd82;">&gt;</span> i 0) (<span style="color: #eedd82;">&gt;</span> j 0) (<span style="color: #eedd82;">=</span> (mget d (<span style="color: #eedd82;">dec</span> i) (<span style="color: #eedd82;">dec</span> j)) (mget d i j)))
   (<span style="color: #b0c4de;">recur</span> d (<span style="color: #eedd82;">dec</span> i) (<span style="color: #eedd82;">dec</span> j) acc)
   <span style="color: #7fffd4;">:else</span> acc))
</pre>
</div>
</div>
</div>
