error-codes.org
** Calculating the edits
   
   With the lev and backtrace function, we can define the edits
   function which returns the edits map described above with the
   minimal edits between the two texts
   #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
     (defn edits [a b]
       (let [d (lev a b)]
         (backtrace d (count a) (count b) {:insertions '() :deletions '()
                                           :substitutions '()
                                           :distance (mget d (count a) (count b))})))
   #+end_src 

   #+RESULTS:
   : #'error-codes.core/edits

   A few examples:
   #+begin_src clojure :ns error-codes.test-core :tangle test/error_codes/test_core.clj :results pp
     (deftest test-edits
       (is (= (edits "a" "b") 
              '{:insertions (), :deletions (), :substitutions ([0 0]), :distance 1}))
       ;;swapping two characters is not multiple substitutions but insertion and deletions
       ;;which is more in line with what humans see there.
       (is (= (edits "ab" "ba")
              '{:insertions ([0 0]), :deletions ([1 2]), :substitutions (), :distance 2}))
       (is (= (edits "vr" "io")
              '{:insertions (), :deletions (), :substitutions ([0 0] [1 1]), :distance 2}))
       ;;many to one errors are substitutions followed by insertions
       (is (= (edits "m" "rn")
              '{:insertions ([1 1]), :deletions (), :substitutions ([0 0]), :distance 2}))
       ;;one to many errors are substitutions followed by deletions
       (is (= (edits "rn" "m")
              '{:insertions (), :deletions ([1 1]), :substitutions ([0 0]), :distance 2}))
       (is (= (edits "Kitten" "sitting")
              '{:insertions ([6 6]), :deletions (), :substitutions ([0 0] [4 4]), :distance 3}))
       (is (= (edits "Kitten" "sittieng")
              '{:insertions ([4 4] [6 7]), :deletions (), :substitutions ([0 0]), :distance 3}))
       (is (= (edits "Kitten" "iiittiing")
              '{:insertions ([2 2] [5 6] [6 8]), :deletions (), :substitutions ([0 0] [4 5]), :distance 5}))
       )


     (test-edits)
   #+end_src 

   #+RESULTS:
   : nil


* Getting the error codes from the edit distance
  With the edits in place, the problem of the proper text alignment is
  solved. what is left to do is mapping the edits to the right error
  codes. Some codes (like [1 1]) which is a simple substitution (see
  table at the top) are trivial to extract from the edit distance.
  But what about the one-to-many errors (codes [x 7]) or the
  many-to-one errors (codes [7 x] or [x 6] the table is not
  deterministic here)

  Like test-edits showed above, one can recognise
  many-to-one/one-to-many errors by substitutions which are followed
  by insertions or deletions

  Therefore, they have to be extracted before the substitutions,
  deletions or insertions are extracted.

  A good architecture for the extracting operation is therefore to
  apply multiple extract /passes/ to the edits to generate the
  error-codes. The extract phases can be defined as functions which 
  get the current edits map and the two texts as arguments and returns
  [new-edits extracted-error-codes].
  The extract phases can simply be stored in a vector which is
  traversed in the extraction phase

  #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
    (declare extraction-list)

    (defn edits-to-error-codes
      ([edits t1 t2] (edits-to-error-codes edits t1 t2 extraction-list))
      ([edits t1 t2 extraction-list]
         (let [{:keys [substitutions deletions insertions]} edits]
           (-> (reduce (fn [[codes edits] f]
                         (let [[ncodes nedits] (f edits t1 t2)]
                           [(concat codes ncodes) nedits])) [[] edits] extraction-list)
               first))))


    (defn error-codes
      [t1 t2]
      (as-> (edits t1 t2) x
            (edits-to-error-codes x t1 t2)
            ;;sort the codes so that the error-codes are ordered by position in text
            (sort-by (comp second second) x)))
  #+end_src 

  #+RESULTS:
  : #'error-codes.core/error-codes


  For the extraction phases we also need a small function which maps a
  character to its number in the matrix.
  #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
    (defn to-code-number [^Character c]
      (cond
       (Character/isLetter c) 1
       (#{\. \, \? \!} c) 2
       (Character/isDigit c) 3
       (= c \space) 5
       :else 4))
  #+end_src 

  #+RESULTS:
  : #'error-codes.core/to-code-number


