error-codes.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Calculating the edits</h3>
<div class="outline-text-3" id="text-3-3">
<p>
With the lev and backtrace function, we can define the edits
function which returns the edits map described above with the
minimal edits between the two texts
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">edits</span> [a b]
  (<span style="color: #b0c4de;">let</span> [d (lev a b)]
    (backtrace d (<span style="color: #eedd82;">count</span> a) (<span style="color: #eedd82;">count</span> b) {<span style="color: #7fffd4;">:insertions</span> '() <span style="color: #7fffd4;">:deletions</span> '()
                                      <span style="color: #7fffd4;">:substitutions</span> '()
                                      <span style="color: #7fffd4;">:distance</span> (mget d (<span style="color: #eedd82;">count</span> a) (<span style="color: #eedd82;">count</span> b))})))
</pre>
</div>

<p>
A few examples:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">deftest</span> <span style="color: #87cefa;">test-edits</span>
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"b"</span>) 
         '{<span style="color: #7fffd4;">:insertions</span> (), <span style="color: #7fffd4;">:deletions</span> (), <span style="color: #7fffd4;">:substitutions</span> ([0 0]), <span style="color: #7fffd4;">:distance</span> 1}))
  <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">swapping two characters is not multiple substitutions but insertion and deletions</span>
  <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">which is more in line with what humans see there.</span>
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"ab"</span> <span style="color: #ffa07a;">"ba"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> ([0 0]), <span style="color: #7fffd4;">:deletions</span> ([1 2]), <span style="color: #7fffd4;">:substitutions</span> (), <span style="color: #7fffd4;">:distance</span> 2}))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"vr"</span> <span style="color: #ffa07a;">"io"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> (), <span style="color: #7fffd4;">:deletions</span> (), <span style="color: #7fffd4;">:substitutions</span> ([0 0] [1 1]), <span style="color: #7fffd4;">:distance</span> 2}))
  <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">many to one errors are substitutions followed by insertions</span>
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"m"</span> <span style="color: #ffa07a;">"rn"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> ([1 1]), <span style="color: #7fffd4;">:deletions</span> (), <span style="color: #7fffd4;">:substitutions</span> ([0 0]), <span style="color: #7fffd4;">:distance</span> 2}))
  <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">one to many errors are substitutions followed by deletions</span>
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"rn"</span> <span style="color: #ffa07a;">"m"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> (), <span style="color: #7fffd4;">:deletions</span> ([1 1]), <span style="color: #7fffd4;">:substitutions</span> ([0 0]), <span style="color: #7fffd4;">:distance</span> 2}))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"Kitten"</span> <span style="color: #ffa07a;">"sitting"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> ([6 6]), <span style="color: #7fffd4;">:deletions</span> (), <span style="color: #7fffd4;">:substitutions</span> ([0 0] [4 4]), <span style="color: #7fffd4;">:distance</span> 3}))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"Kitten"</span> <span style="color: #ffa07a;">"sittieng"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> ([4 4] [6 7]), <span style="color: #7fffd4;">:deletions</span> (), <span style="color: #7fffd4;">:substitutions</span> ([0 0]), <span style="color: #7fffd4;">:distance</span> 3}))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (edits <span style="color: #ffa07a;">"Kitten"</span> <span style="color: #ffa07a;">"iiittiing"</span>)
         '{<span style="color: #7fffd4;">:insertions</span> ([2 2] [5 6] [6 8]), <span style="color: #7fffd4;">:deletions</span> (), <span style="color: #7fffd4;">:substitutions</span> ([0 0] [4 5]), <span style="color: #7fffd4;">:distance</span> 5}))
  )


(test-edits)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Getting the error codes from the edit distance</h2>
<div class="outline-text-2" id="text-4">
<p>
With the edits in place, the problem of the proper text alignment is
solved. what is left to do is mapping the edits to the right error
codes. Some codes (like [1 1]) which is a simple substitution (see
table at the top) are trivial to extract from the edit distance.
But what about the one-to-many errors (codes [x 7]) or the
many-to-one errors (codes [7 x] or [x 6] the table is not
deterministic here)
</p>

<p>
Like test-edits showed above, one can recognise
many-to-one/one-to-many errors by substitutions which are followed
by insertions or deletions
</p>

<p>
Therefore, they have to be extracted before the substitutions,
deletions or insertions are extracted.
</p>

<p>
A good architecture for the extracting operation is therefore to
apply multiple extract <i>passes</i> to the edits to generate the
error-codes. The extract phases can be defined as functions which 
get the current edits map and the two texts as arguments and returns
[new-edits extracted-error-codes].
The extract phases can simply be stored in a vector which is
traversed in the extraction phase
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #eedd82;">declare</span> extraction-list)

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">edits-to-error-codes</span>
  ([edits t1 t2] (edits-to-error-codes edits t1 t2 extraction-list))
  ([edits t1 t2 extraction-list]
     (<span style="color: #b0c4de;">let</span> [{<span style="color: #7fffd4;">:keys</span> [substitutions deletions insertions]} edits]
       (<span style="color: #b0c4de;">-&gt;</span> (<span style="color: #eedd82;">reduce</span> (<span style="color: #00ffff;">fn</span> [[codes edits] f]
                     (<span style="color: #b0c4de;">let</span> [[ncodes nedits] (f edits t1 t2)]
                       [(<span style="color: #eedd82;">concat</span> codes ncodes) nedits])) [[] edits] extraction-list)
           first))))


(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">error-codes</span>
  [t1 t2]
  (as-&gt; (edits t1 t2) x
        (edits-to-error-codes x t1 t2)
        <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">sort the codes so that the error-codes are ordered by position in text</span>
        (<span style="color: #eedd82;">sort-by</span> (<span style="color: #eedd82;">comp</span> second second) x)))
</pre>
</div>


<p>
For the extraction phases we also need a small function which maps a
character to its number in the matrix.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">to-code-number</span> [<span style="color: #b0c4de;">^Character</span> c]
  (<span style="color: #b0c4de;">cond</span>
   (<span style="color: #b0c4de;">Character/isLetter</span> c) 1
   (#{\. \, \? \!} c) 2
   (<span style="color: #b0c4de;">Character/isDigit</span> c) 3
   (<span style="color: #eedd82;">=</span> c \space) 5
   <span style="color: #7fffd4;">:else</span> 4))
</pre>
</div>
</div>
