error-codes.org
** Extracting basic error-codes
   Extraction of the basic error codes for substitution, insertion and
   deletions are easy as they are just the insertions, substitutions
   and deletions in the edits map along with the right error
   code. This extraction functions will be at the bottom of the
   extraction-list
   #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
     (defn extract-substitution-errors [edits t1 t2]
       (let [codes (for [[p1 p2] (:substitutions edits)]
                     (let [c1 (nth t1 p1) c2 (nth t2 p2)
                           [f1 f2] (map to-code-number [c1 c2])]
                       [[f1 f2] [p1 p2]]))]
         [codes (assoc edits :substitutions [])]))

     (defn extract-insertion-errors [edits t1 t2]
       (let [codes (for [[p1 p2] (:insertions edits)]
                     (let [ c2 (nth t2 p2)
                           f2 (to-code-number c2)]
                       [[8 f2] [p1 p2]]))]
         [codes (assoc edits :insertions [])]))

     (defn extract-deletion-errors [edits t1 t2]
       (let [codes (for [[p1 p2] (:deletions edits)]
                     (let [c1 (nth t1 p1) 
                           f1 (to-code-number c1)]
                       [[f1 8] [p1 p2]]))]
         [codes (assoc edits :deletions [])]))
   #+end_src 

   #+RESULTS:
   : #'error-codes.core/extract-deletion-errors


** Extracting many-to-one and one-to-many errors
   Now comes the difficult path. Recognizing the semantic errors which
   are not just basic edits.
