error-codes.html


<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Extracting basic error-codes</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Extraction of the basic error codes for substitution, insertion and
deletions are easy as they are just the insertions, substitutions
and deletions in the edits map along with the right error
code. This extraction functions will be at the bottom of the
extraction-list
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">extract-substitution-errors</span> [edits t1 t2]
  (<span style="color: #b0c4de;">let</span> [codes (<span style="color: #b0c4de;">for</span> [[p1 p2] (<span style="color: #7fffd4;">:substitutions</span> edits)]
                (<span style="color: #b0c4de;">let</span> [c1 (<span style="color: #eedd82;">nth</span> t1 p1) c2 (<span style="color: #eedd82;">nth</span> t2 p2)
                      [f1 f2] (<span style="color: #eedd82;">map</span> to-code-number [c1 c2])]
                  [[f1 f2] [p1 p2]]))]
    [codes (<span style="color: #eedd82;">assoc</span> edits <span style="color: #7fffd4;">:substitutions</span> [])]))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">extract-insertion-errors</span> [edits t1 t2]
  (<span style="color: #b0c4de;">let</span> [codes (<span style="color: #b0c4de;">for</span> [[p1 p2] (<span style="color: #7fffd4;">:insertions</span> edits)]
                (<span style="color: #b0c4de;">let</span> [ c2 (<span style="color: #eedd82;">nth</span> t2 p2)
                      f2 (to-code-number c2)]
                  [[8 f2] [p1 p2]]))]
    [codes (<span style="color: #eedd82;">assoc</span> edits <span style="color: #7fffd4;">:insertions</span> [])]))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">extract-deletion-errors</span> [edits t1 t2]
  (<span style="color: #b0c4de;">let</span> [codes (<span style="color: #b0c4de;">for</span> [[p1 p2] (<span style="color: #7fffd4;">:deletions</span> edits)]
                (<span style="color: #b0c4de;">let</span> [c1 (<span style="color: #eedd82;">nth</span> t1 p1) 
                      f1 (to-code-number c1)]
                  [[f1 8] [p1 p2]]))]
    [codes (<span style="color: #eedd82;">assoc</span> edits <span style="color: #7fffd4;">:deletions</span> [])]))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Extracting many-to-one and one-to-many errors</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Now comes the difficult path. Recognizing the semantic errors which
are not just basic edits.
</p>
</div>
