error-codes.org
*** Recognizing these errors
    #+begin_src clojure :ns error-codes.core :tangle no :results pp
      (edits "mann" "rnann")
    #+end_src 

    #+RESULTS:
    : {:insertions ([1 1]),
    :  :deletions (),
    :  :substitutions ([0 0]),
    :  :distance 2}

    
    #+begin_src clojure :ns error-codes.core :tangle no :results pp
      (edits "rnann" "mann")
    #+end_src 

    #+RESULTS:
    : {:insertions (),
    :  :deletions ([1 1]),
    :  :substitutions ([0 0]),
    :  :distance 2}
    
    We see that many-to-one/one-to-many errors can be recognized by
    substitutions followed by insertions/deletions.
    However we don't want to consume all following
    insertions/deletions when there are to many. Consider this:

    #+begin_src clojure :ns error-codes.core :tangle no :results pp
    (edits "Oma" "Ornrewölkra")
    #+end_src 

    #+RESULTS:
    : {:insertions ([2 2] [2 3] [2 4] [2 5] [2 6] [2 7] [2 8] [2 9]),
    :  :deletions (),
    :  :substitutions ([1 1]),
    :  :distance 9}
    
    If we would just extract all following insertions here this
    wouldn't resemble well an /ocr-error/. Instead we only want to
    consume here the first two insertions for the letters r and n.
    The same is true for many-to-one errors.

    To generalise this observation, we do a /bar-analysis/:
    for one-to-many errors, OCR-engines do mistakes at the level of
    splitting the image into characters. So the width of the right
    character (example \m) and the recognised characters (example "rn"
    or "iii") will be roughly the same. We can therefore count the
    horizontal /bars/ of the recognised characters and stop when their
    bar-count matches the bar-count of the original character.

    We map each character to its number of bars
    (we are dealing with text written in [[http://en.wikipedia.org/wiki/Fraktur][Fraktur]]):
    #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
      (def bar-map
        {\A 2 \a 2 \B 2 \b 2 \C 2 \c 1 \D 2 \d 2 \E 2 \e 1 \F 2 \f 1 \G 3 \g 2
         \H 2 \h 2 \I 2 \J 2 \i 1 \j 1 \K 2 \k 1 \L 2 \l 1 \M 4 \m 3 \N 3 \n 2
         \O 2 \o 2 \P 3 \p 2 \Q 2 \q 2 \R 3 \r 1 \S 2 \s 2 \T 2 \t 1 \U 2 \u 2
         \V 3 \v 2 \W 4 \w 3 \X 2 \x 1 \Y 3 \y 2 \Z 2 \z 1 \ü 2})


      (defn lookup-bar [char]
        (get bar-map char 1))

    #+end_src 

    #+RESULTS:
    : #'error-codes.core/lookup-bar

    
    It can also be that there are multiple one-to-many errors
    following each other. In the edits, this is shown as
    #+begin_src clojure :ns error-codes.core :results pp
     (edits "Mammut" "Marniiiut")
    #+end_src 

    #+RESULTS:
    : {:insertions ([4 4] [4 5] [4 6]),
    :  :deletions (),
    :  :substitutions ([2 2] [3 3]),
    :  :distance 5}

    #+begin_src clojure :ns error-codes.core :results pp
      (edits "Marniiiut" "Mammut")
    #+end_src 

    #+RESULTS:
    : {:insertions (),
    :  :deletions ([4 4] [5 4] [6 4]),
    :  :substitutions ([2 2] [3 3]),
    :  :distance 5}


    So we also have to check for multiple substitutions followed by
    inertions/deletions and then map each character in the
    substitutions to the following characters according to the
    bar-analysis.

    The handling of many-to-one errors is basically the same, the
    differences are how to determine which insertions/deletion follows
    the given and how to label the extracted codes

    #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
      (defn- extract-following-substitutions [substitutions]
        (when (seq substitutions)
          (reduce (fn [l [a b]]
                    (if (= (map inc (last (last l))) [a b])
                      ;;add to current group
                      (update-in l [(dec (count l))] #(conj % [a b]))
                      ;;make a new group
                      (conj l [[a b]])))
                  [[(first substitutions)]] (rest substitutions))))

      (defn- following [[a b] insdel type]
        (loop [[ia ib] [(inc a) (inc b)] acc []]
          (if (some #{[ia ib]} insdel)
            (recur (case type
                     :one-to-many [ia (inc ib)]
                     :many-to-one [(inc ia) ib]) (conj acc [ia ib]))
            acc)))

      (defn- add-following [following-substitutions insdel type]
        (for [fs following-substitutions
              :let [if (following (last fs) insdel type)]
              :when (seq if)]
          [fs (concat fs if)]))

      (defn- take-bars [t1 t2 [a b] insdel type]
        (let [res (let [bar-count (lookup-bar (case type
                                      :one-to-many (nth t1 a)
                                      :many-to-one (nth t2 b)))
                        _ (prn "bar-count " bar-count (nth t1 a))]
          (loop [[[ia ib] & is] insdel acc 0 ret []]
            (if ia
              (let [bc (lookup-bar (case type
                                     :one-to-many (nth t2 ib)
                                     :many-to-one (nth t1 ia)))
                    _ (prn "bc " bc (nth t2 ib)
                           "acc " acc " ret " ret
                           (>= (+ acc bc) bar-count)
                           "ia ib " ia ib)]
                (if (>= (+ acc bc) bar-count)
                  (conj ret [ia ib])
                  (recur is (+ acc bc) (conj ret [ia ib]))))
              ret)))]
           (prn "take-bars " res)
           res))
        ;;;todo take care of how many are allowed to be extracted
        ;;;we know that count-free is > 0 at the beginning
        ;;;be careful at the start of the error
      (defn- extract [t1 t2 fl type]
        (for [[fs insdel] fl]
          (let [_ (prn "fs " fs "insdel " insdel "count-free" (- (count insdel) (count fs)))
                count-free (- (count insdel) (count fs))]
            (loop [[[a b] & ss :as aktfs] fs extr [] insdel insdel
                   count-free (- (count insdel) (count fs))]
              (if (and a (seq insdel))
                (let [ext (take-bars t1 t2 [a b] (take (inc count-free) insdel) type)
                      _ (prn "ext-after-take-bars " [a b]  ext "insdel-for-ext " insdel "count-free " count-free)]
                  (recur ;dont drop here
                   ss
                   (conj extr [[a b] ext])
                   (drop (count ext) insdel)
                   (- count-free (- (count ext) 1))))
                extr)))))

      (defn- delete-from-edits [edits to-delete]
        (into {} (for [[k v] (dissoc edits :distance)] [k (remove (set to-delete) v)])))


      (defn to-single-error [t1 t2 a b]
        (cond
         (= (count t1) a) (let [c2 (nth t2 b)
                                f2 (to-code-number c2)]
                             [[8 f2] [a b]])
         (= (count t2) b) (let [c1 (nth t1 a) 
                                f1 (to-code-number c1)]
                             [[f1 8] [a b]]);;deletion
         :else [[(to-code-number (nth t1 a))
                 (to-code-number (nth t2 b))]
                [a b]]))

      (defn extract-count-changing-errors [type edits t1 t2]
        (let [{:keys [substitutions insertions deletions]} edits
              fs (extract-following-substitutions substitutions)
              _ (prn "fs " fs)
              fi (add-following fs (case type :one-to-many insertions :many-to-one deletions) type)
              _ (prn "fi " fi)
              ext (apply concat (extract t1 t2 fi type))
              _ (prn "ext " ext)
              nedits (delete-from-edits edits (partition 2 (flatten ext)))
              res
              [(for [[[a b] e] ext]
                 (case (count e)
                   1 (let [[_ b] (first e)]
                       (to-single-error t1 t2 a b))
                   (case type
                     :one-to-many [[(to-code-number (nth t1 a)) 7]
                                   [a (second (first e))] [(inc a) (second (last e))]]
                     :many-to-one [[7 (to-code-number (nth t2 b))]
                                   [(first (first e)) b] [(first (last e)) (inc b)]]))) nedits]
              _ (prn "extr " ext "res" (first res))]
          res))


    #+end_src 

    #+RESULTS:
    : #'error-codes.core/extract-count-changing-errors


