error-codes.html
<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Recognizing these errors</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(edits <span style="color: #ffa07a;">"mann"</span> <span style="color: #ffa07a;">"rnann"</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(edits <span style="color: #ffa07a;">"rnann"</span> <span style="color: #ffa07a;">"mann"</span>)
</pre>
</div>

<p>
We see that many-to-one/one-to-many errors can be recognized by
substitutions followed by insertions/deletions.
However we don't want to consume all following
insertions/deletions when there are to many. Consider this:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(edits <span style="color: #ffa07a;">"Oma"</span> <span style="color: #ffa07a;">"Ornrew&#246;lkra"</span>)
</pre>
</div>

<p>
If we would just extract all following insertions here this
wouldn't resemble well an <i>ocr-error</i>. Instead we only want to
consume here the first two insertions for the letters r and n.
The same is true for many-to-one errors.
</p>

<p>
To generalise this observation, we do a <i>bar-analysis</i>:
for one-to-many errors, OCR-engines do mistakes at the level of
splitting the image into characters. So the width of the right
character (example \m) and the recognised characters (example "rn"
or "iii") will be roughly the same. We can therefore count the
horizontal <i>bars</i> of the recognised characters and stop when their
bar-count matches the bar-count of the original character.
</p>

<p>
We map each character to its number of bars
(we are dealing with text written in <a href="http://en.wikipedia.org/wiki/Fraktur">Fraktur</a>):
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">bar-map</span>
  {\A 2 \a 2 \B 2 \b 2 \C 2 \c 1 \D 2 \d 2 \E 2 \e 1 \F 2 \f 1 \G 3 \g 2
   \H 2 \h 2 \I 2 \J 2 \i 1 \j 1 \K 2 \k 1 \L 2 \l 1 \M 4 \m 3 \N 3 \n 2
   \O 2 \o 2 \P 3 \p 2 \Q 2 \q 2 \R 3 \r 1 \S 2 \s 2 \T 2 \t 1 \U 2 \u 2
   \V 3 \v 2 \W 4 \w 3 \X 2 \x 1 \Y 3 \y 2 \Z 2 \z 1 \&#252; 2})


(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">lookup-bar</span> [char]
  (<span style="color: #eedd82;">get</span> bar-map char 1))
</pre>
</div>


<p>
It can also be that there are multiple one-to-many errors
following each other. In the edits, this is shown as
</p>
<div class="org-src-container">

<pre class="src src-clojure">(edits <span style="color: #ffa07a;">"Mammut"</span> <span style="color: #ffa07a;">"Marniiiut"</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(edits <span style="color: #ffa07a;">"Marniiiut"</span> <span style="color: #ffa07a;">"Mammut"</span>)
</pre>
</div>


<p>
So we also have to check for multiple substitutions followed by
inertions/deletions and then map each character in the
substitutions to the following characters according to the
bar-analysis.
</p>

<p>
The handling of many-to-one errors is basically the same, the
differences are how to determine which insertions/deletion follows
the given and how to label the extracted codes
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">defn-</span> <span style="color: #87cefa;">extract-following-substitutions</span> [substitutions]
  (<span style="color: #b0c4de;">when</span> (<span style="color: #eedd82;">seq</span> substitutions)
    (<span style="color: #eedd82;">reduce</span> (<span style="color: #00ffff;">fn</span> [l [a b]]
              (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">=</span> (<span style="color: #eedd82;">map</span> inc (<span style="color: #eedd82;">last</span> (<span style="color: #eedd82;">last</span> l))) [a b])
                <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">add to current group</span>
                (<span style="color: #eedd82;">update-in</span> l [(<span style="color: #eedd82;">dec</span> (<span style="color: #eedd82;">count</span> l))] #(<span style="color: #eedd82;">conj</span> % [a b]))
                <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">make a new group</span>
                (<span style="color: #eedd82;">conj</span> l [[a b]])))
            [[(<span style="color: #eedd82;">first</span> substitutions)]] (<span style="color: #eedd82;">rest</span> substitutions))))

(<span style="color: #00ffff;">defn-</span> <span style="color: #87cefa;">following</span> [[a b] insdel type]
  (<span style="color: #b0c4de;">loop</span> [[ia ib] [(<span style="color: #eedd82;">inc</span> a) (<span style="color: #eedd82;">inc</span> b)] acc []]
    (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">some</span> #{[ia ib]} insdel)
      (<span style="color: #b0c4de;">recur</span> (<span style="color: #b0c4de;">case</span> type
               <span style="color: #7fffd4;">:one-to-many</span> [ia (<span style="color: #eedd82;">inc</span> ib)]
               <span style="color: #7fffd4;">:many-to-one</span> [(<span style="color: #eedd82;">inc</span> ia) ib]) (<span style="color: #eedd82;">conj</span> acc [ia ib]))
      acc)))

(<span style="color: #00ffff;">defn-</span> <span style="color: #87cefa;">add-following</span> [following-substitutions insdel type]
  (<span style="color: #b0c4de;">for</span> [fs following-substitutions
        <span style="color: #7fffd4;">:let</span> [if (following (<span style="color: #eedd82;">last</span> fs) insdel type)]
        <span style="color: #7fffd4;">:when</span> (<span style="color: #eedd82;">seq</span> if)]
    [fs (<span style="color: #eedd82;">concat</span> fs if)]))


(<span style="color: #00ffff;">defn-</span> <span style="color: #87cefa;">take-bars</span> [t1 t2 [a b] insdel type]
  (<span style="color: #b0c4de;">let</span> [res (<span style="color: #b0c4de;">let</span> [bar-count (lookup-bar (<span style="color: #b0c4de;">case</span> type
                                <span style="color: #7fffd4;">:one-to-many</span> (<span style="color: #eedd82;">nth</span> t1 a)
                                <span style="color: #7fffd4;">:many-to-one</span> (<span style="color: #eedd82;">nth</span> t2 b)))
                  _ (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"bar-count "</span> bar-count (<span style="color: #eedd82;">nth</span> t1 a))]
    (<span style="color: #b0c4de;">loop</span> [[[ia ib] &amp; is] insdel acc 0 ret []]
      (<span style="color: #b0c4de;">if</span> ia
        (<span style="color: #b0c4de;">let</span> [bc (lookup-bar (<span style="color: #b0c4de;">case</span> type
                               <span style="color: #7fffd4;">:one-to-many</span> (<span style="color: #eedd82;">nth</span> t2 ib)
                               <span style="color: #7fffd4;">:many-to-one</span> (<span style="color: #eedd82;">nth</span> t1 ia)))
              _ (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"bc "</span> bc)]
          (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">&gt;=</span> (<span style="color: #eedd82;">+</span> acc bc) bar-count)
            (<span style="color: #eedd82;">conj</span> ret [ia ib])
            (<span style="color: #b0c4de;">recur</span> is (<span style="color: #eedd82;">+</span> acc bc) (<span style="color: #eedd82;">conj</span> ret [ia ib]))))
        ret)))]
     (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"take-bars "</span> res)
     res))

(<span style="color: #00ffff;">defn-</span> <span style="color: #87cefa;">extract</span> [t1 t2 fl type]
  (<span style="color: #b0c4de;">for</span> [[fs insdel] fl]
    (<span style="color: #b0c4de;">loop</span> [[[a b] &amp; ss] fs extr [] insdel insdel]
      (<span style="color: #b0c4de;">if</span> a
        (<span style="color: #b0c4de;">let</span> [ext (take-bars t1 t2 [a b] insdel type)]
          (<span style="color: #b0c4de;">recur</span> ss (<span style="color: #eedd82;">conj</span> extr [[a b] ext]) (<span style="color: #eedd82;">drop</span> (<span style="color: #eedd82;">count</span> ext) insdel)))
        extr))))

(<span style="color: #00ffff;">defn-</span> <span style="color: #87cefa;">delete-from-edits</span> [edits to-delete]
  (<span style="color: #eedd82;">into</span> {} (<span style="color: #b0c4de;">for</span> [[k v] (<span style="color: #eedd82;">dissoc</span> edits <span style="color: #7fffd4;">:distance</span>)] [k (<span style="color: #eedd82;">remove</span> (<span style="color: #eedd82;">set</span> to-delete) v)])))


(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">extract-count-changing-errors</span> [type edits t1 t2]
  (<span style="color: #b0c4de;">let</span> [{<span style="color: #7fffd4;">:keys</span> [substitutions insertions deletions]} edits
        fs (extract-following-substitutions substitutions)
        _ (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"fs "</span> fs)
        fi (add-following fs (<span style="color: #b0c4de;">case</span> type <span style="color: #7fffd4;">:one-to-many</span> insertions <span style="color: #7fffd4;">:many-to-one</span> deletions) type)
        _ (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"fi "</span> fi)
        ext (<span style="color: #eedd82;">apply</span> concat (extract t1 t2 fi type))
        _ (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"ext "</span> ext)
        nedits (delete-from-edits edits (<span style="color: #eedd82;">partition</span> 2 (<span style="color: #eedd82;">flatten</span> ext)))
        res
        [(<span style="color: #b0c4de;">for</span> [[[a b] e] ext]
           (<span style="color: #b0c4de;">case</span> (<span style="color: #eedd82;">count</span> e)
             1 [[(to-code-number (<span style="color: #eedd82;">nth</span> t1 a)) (to-code-number (<span style="color: #eedd82;">nth</span> t2 b))] [a b]]
             [(<span style="color: #b0c4de;">case</span> type
                <span style="color: #7fffd4;">:one-to-many</span> [(to-code-number (<span style="color: #eedd82;">nth</span> t1 a)) 7]
                <span style="color: #7fffd4;">:many-to-one</span> [7 (to-code-number (<span style="color: #eedd82;">nth</span> t2 b))]) [a b] (<span style="color: #eedd82;">last</span> e)])) nedits]
        _ (<span style="color: #eedd82;">prn</span> <span style="color: #ffa07a;">"ext "</span> ext <span style="color: #ffa07a;">"res"</span> (<span style="color: #eedd82;">first</span> res))]
    res))
</pre>
</div>
</div>
</div>
</div>
