error-codes.org
** Setting up the extraction list
   Now the extraction list can be filled. First the one-to-many and
   many-to-one errors have to be processed. After that the basic
   substitution, insertion and deletion errors can be extracted
   #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
     (def extraction-list
       [(partial extract-count-changing-errors :one-to-many)
        (partial extract-count-changing-errors :many-to-one)
        extract-substitution-errors
        extract-insertion-errors
        extract-deletion-errors])
   #+end_src 

   #+RESULTS:
   : #'error-codes.core/extraction-list


