error-codes.html


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Setting up the extraction list</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Now the extraction list can be filled. First the one-to-many and
many-to-one errors have to be processed. After that the basic
substitution, insertion and deletion errors can be extracted
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">extraction-list</span>
  [(<span style="color: #eedd82;">partial</span> extract-count-changing-errors <span style="color: #7fffd4;">:one-to-many</span>)
   (<span style="color: #eedd82;">partial</span> extract-count-changing-errors <span style="color: #7fffd4;">:many-to-one</span>)
   extract-substitution-errors
   extract-insertion-errors
   extract-deletion-errors])
</pre>
</div>
</div>
</div>
</div>
