error-codes.html


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Testing the error-codes</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">deftest</span> <span style="color: #87cefa;">test-error-codes</span>
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (error-codes <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"b"</span>)
         '([[1 1] [0 0]])))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (error-codes <span style="color: #ffa07a;">"kitten"</span> <span style="color: #ffa07a;">"sitting"</span>)
         '([[1 1] [0 0]] [[1 1] [4 4]] [[8 1] [6 6]])))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (error-codes <span style="color: #ffa07a;">"m"</span> <span style="color: #ffa07a;">"rn"</span>)
         '([[1 7] [0 0] [1 1]])))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (error-codes <span style="color: #ffa07a;">"Mammut"</span> <span style="color: #ffa07a;">"rnarniiiut"</span>)
         '([[1 7] [0 0] [1 1]] [[1 7] [2 3] [3 4]] [[1 7] [3 4] [4 7]])))
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (error-codes <span style="color: #ffa07a;">"rnarniiiut"</span> <span style="color: #ffa07a;">"Mammut"</span>)
         '([[7 1] [0 0] [1 1]] [[7 1] [3 2] [4 3]] [[7 1] [4 3] [7 4]]))))

(test-error-codes)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #00ffff;">deftest</span> <span style="color: #87cefa;">big-error-codes-test</span>
  (<span style="color: #98fb98;">is</span> (<span style="color: #eedd82;">=</span> (error-codes <span style="color: #ffa07a;">"78\n\nschneider, vom blo&#223;en Geldverdienst absehend, mit sch&#246;ner Beharrlichkeit dem Ziele\nnachstrebten, ein wirkliches Kunstwerk zu schaffen. Da&#223; ihnen dies bis zu einem\ngewissen Grade gelungen ist, leidet keinen Zweifel; jedenfalls ist die Federzeichnung,\nnach welcher der Holzschneider gearbeitet hat, in allen St&#252;cken getreu und correct,\nwird m&#246;chten sagen zu correct und getreu, wiedergegeben.\n\tDas Werk stellt eine Felsschlucht dar, in welcher eine L&#246;win ihren vor ihr\nhingestreckten, von einem Wurfspie&#223; durchbohrten Gemahl betrauert, w&#228;hrend oben\ndurch eine Oeffnung in der Steinwand Beduinenj&#228;ger sichtbar werden, die auch ihr\nLeben zu bedrohen scheinen. Die Gruppirung dieser Figuren ist gut, die Bewegung\nder L&#246;win ist - in der Conception - ebenfalls angemessen. Die J&#228;ger h&#228;tten\nf&#252;glich wegbleiben k&#246;nnen, da sie, wofern sie den auch der L&#246;win drohenden Tod\nandeuten sollen, die eigentliche Wirkung des Bildes der trauernden L&#246;win st&#246;ren;\nsollen sie aber sagen, da&#223; der L&#246;we durch J&#228;ger umgekommen ist, so sind sie &#252;ber-\nfl&#252;ssig, da die Ursache des Todes schon hinreichend durch den im Leibe des Thieres\nsteckenden abgebrochenen Spie&#223; angegeben ist.\n\tDas Bild w&#252;rde ferner an Wirkung gewonnen haben durch eine feinere Beob-\nachtung des Stofflichen. Das Fell der Thiere, Sandboden mit Halfehgras, Felswand,\nPalmen und Aloe sind in der technischen Behandlung jedenfalls zu gleichm&#228;&#223;ig. So\nh&#228;tte beispielsweise die Schattenseite der Felswand, rechts wo die J&#228;ger herablugen,\nruhiger und in zur&#252;ckweichenden T&#246;nen behandelt werden sollen. Der K&#246;rper des lie-\ngenden L&#246;wen h&#228;tte sich mehr rund von der Fl&#228;che abheben m&#252;ssen, wie auch die ganze\nMuskulatur der Thiere noch pr&#228;ciser und energischer sein k&#246;nnte. Endlich aber will\ndas Blut vor dem Maule des todten L&#246;wen uns nicht recht wie Blut erscheinen.\nTrotz dieser Ausstellungen an den Einzelnheiten verdient das Blatt als Ganzes -\nnamentlich als t&#252;chtiger gesunder Holzschnitt - den besten Leistungen der Gegen-\nwart auf diesem Gebiet beigerechnet zu werden, und in dieser Eigenschaft empfehlen\nwir es allen Freunden der Kunst angelegentlich.\n\nLiteratur.\n\n\tDie B&#246;hmischen Exulanten in Sachsen von Chr. A. Pescheck Leipzig,\nS. Hirzel 1857. - Es ist von mehrfachem Interesse zu ermitteln, wie die einzel-\nnen B&#246;lterst&#228;mme des gegenw&#228;rtigen Deutschlands durch die Ueberg&#228;nge der In-\ndividuen aus einem Stamme in den andern allm&#228;lig zu einer deutschen Nation\ngemischt worden sind. Das Ineinanderflie&#223;en der St&#228;mme durch Ein- und Aus-\nwanderung war w&#228;hrend fast zwei Jahrtausenden niemals ganz unterbrochen, hat\naber in verschiedenen Zeitr&#228;umen besondere Ausdehnung erreicht. Von der politischen\nGeschichte wird das massenhafte Einstr&#246;men der Deutschen in das Slavenland zwischen\nElbe und Weichsel noch am ausf&#252;hrlichsten behandelt. Aber nicht weniger eigenth&#252;mlich\nwaren die Verh&#228;ltnisse in B&#246;hmen. Seit dem fr&#252;hsten Mittelalter fand dorthin ein fried-\nliches Einziehen deutscher Bildung und deutscher Individuen statt. Doch die deutsche\nColonisation des Landes wurde mehr als einmal durch eine kr&#228;ftige Gegenstr&#246;mung\n"</span>


    <span style="color: #ffa07a;">" \n\n \n\n  \n\n78\n\nschneidet, vom blo&#223;en Geldberdienst absehend, mit sch&#246;ner Beharrlichkeit dem Ziele\nnachstrebten, ein wirtliches Kunstiverk zu schaffen. Da&#223; ihnen dies bis zu einem\ngewissen Grade gelungen ist, leidet keinen Zweifel; jedenfalls ist die Federzeiehnung\nnach welcher der Holzschneidcr gearbeitet hat, in allen St&#252;cken getreu und eorrect,\nwird m&#246;chten sagen zu eorrect und getreu, niiedkkgegelbkk\n\nDas Werk stellt eine Felsschlucht dar, in welcher eine L&#246;win ihren vor ihr\nlniigestrecktenj von einein Wurfspie&#223; durchbohrter! Gemahl betrauert, w&#228;hrend oben\ndurch eine Oeffnung in der Steinwand Beduiiienj&#228;gssr sichtbar werden, die auch ihr\nLeben zu bedrohen scheinen. Die Gruppiruiig dieser Figuren ist gut, die Bewegung\nder L&#246;win ist &#8212;-- in der Conceptivii &#8212;-&#8212; ebenfalls angemessen. Die J&#228;ger h&#228;tten\nf&#252;glich wegbleiben k&#246;nnen, da sie, wofern sie den auch der L&#246;win drohenden Tod\nandeuten sollen, die eigentliche Wirkung des Bildes der trauernden L&#246;win st&#246;ren;\nsollen sie aber sagen, da&#223; der L&#246;we durch J&#228;ger umgekommen ist, so smd sie Liber-\nfl&#252;ssig, da die Ursache des Todes schon hinreichend durch den im Leibe des Thieres\nsteckenden abgebrochenen Spie&#223; angegeben ist.\n\nDas Bild wiirde ferner an Wirkung gewonnen haben durch eine feinere Beob-\nachtung des Stofflichen. Das Fell der Thiere, Sandboden mit Halfehgras Felswand,\nPalmen undAloe sind in der technischen Behandlung jedenfalls zu gleichni&#228;&#223;ig So\nh&#228;tte beispielsweise die Schattenseite der Felswand, rechts wo die J&#228;ger herablugen,\nruhiger und in zuriietkveichendeii T&#246;nen behandelt werden sollen. Der K&#246;rper des lie-\ngenden L&#246;wen h&#228;tte sich mehr rund von der Fl&#228;che abhebeii m&#252;ssen, wie auch die ganze\nMuskulatur derThiere noch pr&#228;ciser und energischer sein k&#246;nnte. Endlich aber will\ndas Blut vor den! Maule des todten L&#246;wen uns nicht recht wie Blut erscheinen.\nTrotz dieser Ansstellungen an den Einzelnhciten verdient das Blatt als Ganzes &#8212;-\nnamentlich als t&#252;chtiger gesunder Holzsehnitt &#8212; den besten Leistungen der Gegen-\n\n \n\nwart auf diescni Gebiet beigereehnet zu werden, und in dieser Eigenschaft empfehlen.\n\nwir es allen Freunden der Kunst angelegentlichJ &#171;\n\nLiteratur.\n\nDie B&#246;hmischen Exulanten in Sachsen von Chr. A. Pescheclc Leipzig- &#171;\n\nS. Hirzel 1857. &#8212;- Es ist von mehrfacheni Interesse zu ermitteln, wie die einzel-\nnen B&#246;lterst&#228;nune des gegenw&#228;rtigen Deutschlands durch die Ueberg&#228;iige der IN-\ndividuen aus einem Stamme in den andern allm&#228;lig zu einer deutschen Nation\ngemischt worden sind Das Ineinanderflie&#223;en der St&#228;mme durch Em- und Aus-\nwanderung war w&#228;hrend fast zwei Jahrtausenden niemals ganz unterbrochen, hat\naber in verschiedenen Zeitriiumen besondere Ausdehnung erreicht. Von der politischen\nGeschichte wird das massenhafteEinstr&#246;iiieii der Deutschen in das Slavenland zwischen\nElbe Und Weichsel noch am ausf&#252;hrlichsteii behandelt. Aber nicht weniger eigenthiinilich\nwaren die Verh&#228;ltnisse in B&#246;hmen. Seit dem friihsten Neittelalter fand dorthin ein fried-\nliches Einziehen deutscher Bildung und deutscher Individuen statt. Doch die dcutsche\nColonisation des Landes wurde niehr als einmal durch eine triistige lihegeiistr&#246;mung\n\n  \n\n"</span>)
         '([[8 5] [0 0]] [[8 4] [0 1]] [[8 4] [0 2]] [[8 5] [0 3]] [[8 4] [0 4]] [[8 4] [0 5]] [[8 5] [0 6]] [[8 5] [0 7]] [[8 4] [0 8]] [[8 4] [0 9]] [[1 1] [12 22]] [[1 1] [30 40]] [[1 1] [108 118]] [[1 7] [121 131] [122 132]] [[1 1] [246 257]] [[2 8] [252 263]] [[1 1] [282 292]] [[1 1] [329 339]] [[1 1] [360 370]] [[1 1] [380 390]] [[8 1] [382 392]] [[1 1] [384 395]] [[1 1] [385 396]] [[8 1] [390 401]] [[1 1] [391 403]] [[1 1] [392 404]] [[2 4] [393 405]] [[4 8] [395 407]] [[1 7] [471 482] [472 483]] [[1 1] [473 485]] [[2 1] [485 497]] [[1 7] [495 507] [496 508]] [[1 7] [518 531] [519 532]] [[1 7] [593 607] [594 608]] [[1 1] [599 614]] [[8 1] [600 615]] [[1 7] [672 688] [673 689]] [[8 4] [726 743]] [[8 4] [727 745]] [[1 1] [743 762]] [[1 7] [744 763] [745 764]] [[8 4] [746 766]] [[8 4] [747 768]] [[7 1] [1015 1037] [1016 1038]] [[1 1] [1023 1044]] [[8 1] [1024 1045]] [[4 4] [1158 1180]] [[1 1] [1169 1191]] [[8 1] [1170 1192]] [[2 8] [1302 1325]] [[5 8] [1324 1346]] [[1 7] [1385 1406] [1386 1407]] [[2 8] [1390 1412]] [[1 1] [1498 1519]] [[1 1] [1499 1520]] [[8 1] [1500 1521]] [[8 1] [1500 1522]] [[1 1] [1501 1524]] [[1 7] [1510 1533] [1511 1534]] [[1 7] [1618 1642] [1619 1643]] [[5 8] [1661 1686]] [[1 7] [1745 1769] [1746 1770]] [[1 1] [1821 1846]] [[1 1] [1849 1874]] [[8 4] [1885 1910]] [[1 1] [1926 1952]] [[4 4] [1933 1959]] [[8 4] [1968 1994]] [[8 5] [1968 1995]] [[8 4] [1968 1996]] [[8 4] [1968 1997]] [[1 1] [1981 2011]] [[1 7] [1982 2012] [1983 2013]] [[1 1] [1998 2029]] [[8 2] [2050 2081]] [[8 4] [2051 2083]] [[2 1] [2097 2130]] [[8 5] [2098 2131]] [[8 4] [2098 2132]] [[4 8] [2112 2147]] [[1 1] [2168 2202]] [[8 1] [2169 2203]] [[2 4] [2177 2212]] [[8 5] [2178 2213]] [[8 4] [2178 2214]] [[8 4] [2179 2216]] [[8 4] [2195 2233]] [[1 7] [2217 2256] [2218 2257]] [[1 7] [2272 2312] [2273 2313]] [[1 1] [2273 2313]] [[1 7] [2324 2365] [2325 2366]] [[1 1] [2333 2375]] [[2 8] [2431 2473]] [[7 1] [2473 2514] [2474 2515]] [[1 1] [2590 2630]] [[8 1] [2591 2631]] [[5 8] [2678 2719]] [[1 7] [2686 2726] [2687 2728]] [[1 7] [2688 2730] [2689 2731]] [[1 1] [2736 2779]] [[1 7] [2771 2814] [2772 2815]] [[1 1] [2810 2854]] [[1 7] [2811 2855] [2812 2856]] [[8 1] [2812 2857]] [[1 1] [2862 2908]] [[8 1] [2863 2909]] [[1 7] [2869 2916] [2870 2917]] [[1 1] [2982 3030]] [[1 7] [3020 3068] [3021 3069]] [[1 1] [3047 3096]] [[1 1] [3049 3098]] [[1 1] [3050 3099]] [[8 1] [3051 3100]] [[1 7] [3056 3106] [3057 3108]] [[1 7] [3060 3112] [3061 3113]] [[8 4] [3070 3123]] [[8 5] [3070 3124]] [[8 5] [3070 3125]] [[8 4] [3070 3126]] [[8 4] [3070 3127]]))))

(big-error-codes-test)
</pre>
</div>
</div>
</div>
