error-codes.org
* Helpers for deployment to ocr-visualizer
  doesn't belong to the code - ignore
  #+begin_src clojure :ns error-codes.core :tangle src/error_codes/core.clj
      (use 'clojure.java.io)
      (defn get-files-sorted [dir]
        (->> (file-seq (file dir))
             rest
             (sort-by #(.getName  %))))


    (defn deploy-to-ocr-visualizer []
      (let [gts (get-files-sorted "/home/kima/programming/ocr-visualizer/resources/public/ground-truth/")
            ocr-res (get-files-sorted "/home/kima/programming/ocr-visualizer/resources/public/ocr-results/")]
        (doall (pmap (fn [gt ocr]
                       (let [filename (str "/home/kima/programming/ocr-visualizer/resources/public/edits/" (.getName gt))]
                       (prn "error-counts for " filename)
                       (spit filename (pr-str (error-codes (slurp gt) (slurp ocr))))))
                     gts ocr-res))))


    (defn deploy-error-codes [base-directory]
      (let [gts (get-files-sorted (file base-directory "ground-truth/"))
            ocr-res (get-files-sorted (file base-directory "ocr-results/"))]
        (doall (pmap (fn [gt ocr]
                       (let [filename (file base-directory
                                            "edits/" (.getName gt))]
                         (prn "error-counts for " filename)
                         (spit filename (pr-str (error-codes (slurp gt) (slurp ocr))))))
                     gts ocr-res))))


  #+end_src 

  #+RESULTS:
  : #'error-codes.core/visualize







* Todos
** TODO determine right error codes for many-to-one errors 
   
